import { DataKey, MockDataInit } from './DataTypes';

export const MockData: MockDataInit[] = [
  {
    title: DataKey.History,
    years: {
      start: 2010,
      end: 2018,
    },
    events: [
      {
        year: 2010,
        fact: 'Извержение вулкана Эйяфьядлайёкюдль в Исландии, приведшее к масштабным нарушениям авиасообщения в Европе.',
      },
      {
        year: 2011,
        fact: 'Арабская весна: массовые протесты и революции в странах Ближнего Востока и Северной Африки.',
      },
      {
        year: 2012,
        fact: 'Завершение строительства самого высокого здания в мире - Бурдж-Халифа в Дубае.',
      },
      {
        year: 2013,
        fact: 'Избрание Франциска Папой Римским.',
      },
      {
        year: 2014,
        fact: 'Начало конфликта на востоке Украины.',
      },
      {
        year: 2015,
        fact: 'Подписание Парижского соглашения по климату.',
      },
      {
        year: 2016,
        fact: 'Британия голосует за выход из Европейского союза (Brexit).',
      },
      {
        year: 2017,
        fact: 'Первая успешная трансплантация головы крысы.',
      },
      {
        year: 2018,
        fact: 'Открытие самого длинного морского моста в мире между Гонконгом и Макао.',
      },
    ],
  },
  {
    title: DataKey.Technology,
    years: {
      start: 2012,
      end: 2020,
    },
    events: [
      {
        year: 2012,
        fact: 'Запуск проекта Google Glass.',
      },
      {
        year: 2013,
        fact: 'Появление первого коммерческого квантового компьютера от компании D-Wave.',
      },
      {
        year: 2014,
        fact: 'Apple представила первые умные часы Apple Watch.',
      },
      {
        year: 2015,
        fact: 'Разработка технологии CRISPR для редактирования генома.',
      },
      {
        year: 2016,
        fact: 'Запуск первого частного космического корабля Dragon 2 от компании SpaceX.',
      },
      {
        year: 2017,
        fact: 'Компания Google представила смартфон Google Pixel 2.',
      },
      {
        year: 2018,
        fact: 'Успешный запуск Tesla Roadster в космос с помощью ракеты Falcon Heavy.',
      },
      {
        year: 2019,
        fact: 'Huawei представила первый в мире 5G-смартфон.',
      },
      {
        year: 2020,
        fact: 'Компания Neuralink провела первую успешную имплантацию нейронного интерфейса.',
      },
    ],
  },
  {
    title: DataKey.Sports,
    years: {
      start: 2008,
      end: 2016,
    },
    events: [
      {
        year: 2008,
        fact: 'Олимпийские игры в Пекине: рекорд Майкла Фелпса по количеству золотых медалей на одних играх.',
      },
      {
        year: 2009,
        fact: 'Победа Барселоны в Лиге чемпионов УЕФА.',
      },
      {
        year: 2010,
        fact: 'Чемпионат мира по футболу в ЮАР: победа сборной Испании.',
      },
      {
        year: 2011,
        fact: 'Лионель Месси признан лучшим футболистом мира по версии ФИФА.',
      },
      {
        year: 2012,
        fact: 'Олимпийские игры в Лондоне: Усэйн Болт выигрывает три золотые медали.',
      },
      {
        year: 2013,
        fact: 'Майами Хит побеждают в финале НБА.',
      },
      {
        year: 2014,
        fact: 'Чемпионат мира по футболу в Бразилии: победа сборной Германии.',
      },
      {
        year: 2015,
        fact: 'Сборная Новой Зеландии по регби побеждает на Кубке мира.',
      },
      {
        year: 2016,
        fact: 'Олимпийские игры в Рио-де-Жанейро: Симона Байлз завоевывает четыре золотые медали.',
      },
    ],
  },
  {
    title: DataKey.Culture,
    years: {
      start: 2011,
      end: 2019,
    },
    events: [
      {
        year: 2011,
        fact: 'Выход финального фильма из серии "Гарри Поттер" - "Гарри Поттер и Дары Смерти: Часть 2".',
      },
      {
        year: 2012,
        fact: 'Премьера фильма "Мстители" от Marvel.',
      },
      {
        year: 2013,
        fact: 'Появление сериала "Во все тяжкие", признанного одним из лучших сериалов всех времен.',
      },
      {
        year: 2014,
        fact: 'Выход фильма "Интерстеллар" режиссера Кристофера Нолана.',
      },
      {
        year: 2015,
        fact: 'Премьера фильма "Звездные войны: Пробуждение силы".',
      },
      {
        year: 2016,
        fact: 'Выход альбома Бейонсе "Lemonade".',
      },
      {
        year: 2017,
        fact: 'Премьера сериала "Игра престолов" 7 сезон.',
      },
      {
        year: 2018,
        fact: 'Выход фильма "Черная Пантера" от Marvel, ставшего культурным феноменом.',
      },
      {
        year: 2019,
        fact: 'Выход финального сезона сериала "Игра престолов".',
      },
    ],
  },
  {
    title: DataKey.Economy,
    years: {
      start: 2013,
      end: 2021,
    },
    events: [
      {
        year: 2013,
        fact: 'Китай становится крупнейшей экономикой мира по ВВП (ППС).',
      },
      {
        year: 2014,
        fact: 'Снижение цен на нефть на мировом рынке.',
      },
      {
        year: 2015,
        fact: 'Греция объявляет дефолт по внешнему долгу.',
      },
      {
        year: 2016,
        fact: 'Brexit: Британия голосует за выход из ЕС, что вызывает экономические потрясения.',
      },
      {
        year: 2017,
        fact: 'Bitcoin достигает рекордной отметки в 20,000 долларов.',
      },
      {
        year: 2018,
        fact: 'Торговая война между США и Китаем обостряется.',
      },
      {
        year: 2019,
        fact: 'Введение новых санкций против России.',
      },
      {
        year: 2020,
        fact: 'Пандемия COVID-19 вызывает глобальный экономический кризис.',
      },
      {
        year: 2021,
        fact: 'Рост интереса к криптовалютам и NFT.',
      },
    ],
  },
  {
    title: DataKey.Ecology,
    years: {
      start: 2014,
      end: 2022,
    },
    events: [
      {
        year: 2014,
        fact: 'Выбросы CO2 достигают рекордного уровня.',
      },
      {
        year: 2015,
        fact: 'Подписание Парижского соглашения по климату.',
      },
      {
        year: 2016,
        fact: 'Утверждение новой климатической политики в Индии.',
      },
      {
        year: 2017,
        fact: 'Китай запрещает импорт пластиковых отходов.',
      },
      {
        year: 2018,
        fact: 'Пластиковый остров в Тихом океане достигает рекордных размеров.',
      },
      {
        year: 2019,
        fact: 'Начало глобального молодежного климатического движения Fridays for Future.',
      },
      {
        year: 2020,
        fact: 'Снижение уровня загрязнения воздуха во время пандемии COVID-19.',
      },
      {
        year: 2021,
        fact: 'Лесные пожары в Австралии уничтожают миллионы гектаров леса.',
      },
      {
        year: 2022,
        fact: 'Появление первых результатов исследования воздействия микропластика на здоровье человека.',
      },
    ],
  },
];
